tap "oven-sh/bun"
brew "bat"
brew "caddy"
brew "cmake"
brew "colima"
brew "coreutils"
brew "diff-so-fancy"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fnm"
brew "fzf"
brew "gh"
brew "glab"
brew "httpie"
brew "just"
brew "lazydocker"
brew "lazygit"
brew "lazyssh"
brew "mcp-grafana"
brew "mole"
brew "neovim"
brew "node"
brew "ni"
brew "ripgrep"
brew "opencode"
brew "openjdk"
brew "pnpm"
brew "pyenv"
brew "stow"
brew "tlrc"
brew "tmux"
brew "topgrade"
brew "uv"
brew "yarn"
brew "yazi"
brew "zig"
brew "zinit"
brew "zoxide"
brew "oven-sh/bun/bun"
cask "1password"
cask "1password-cli"
cask "arc"
cask "betterdisplay"
cask "browserstacklocal"
cask "chatgpt"
cask "claude-code"
cask "cmux"
cask "codex"
cask "cursor"
cask "cursor-cli"
cask "droid"
cask "figma"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "helium-browser"
cask "karabiner-elements"
cask "lasso-app"
cask "logi-options+"
cask "pearcleaner"
cask "rocket-chat"
cask "telegram"
cask "viscosity"
cask "warp"
cask "zen"
vscode "anthropic.claude-code"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "clinyong.vscode-css-modules"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "imgildev.vscode-auto-barrel"
vscode "mrmlnc.vscode-scss"
vscode "openai.chatgpt"
vscode "qwtel.sqlite-viewer"
vscode "sst-dev.opencode"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-russian"
vscode "stylelint.vscode-stylelint"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "yoavbls.pretty-ts-errors"
cargo "cargo-zigbuild"
