tap "jnsahaj/lumen"
tap "oven-sh/bun"
tap "peonping/tap"
tap "steipete/tap"
tap "unhappychoice/tap"
tap "yuccastream/tap"
brew "asciiquarium"
brew "ast-grep"
brew "bat"
brew "bats-core"
brew "caddy"
brew "colima"
brew "coreutils"
brew "diff-so-fancy"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fnm"
brew "fzf"
brew "gh"
brew "glab"
brew "httpie"
brew "just"
brew "lazydocker"
brew "lazygit"
brew "mole"
brew "neovim"
brew "node"
brew "ni"
brew "noti"
brew "ripgrep"
brew "opencode"
brew "openjdk"
brew "pnpm"
brew "pyenv"
brew "stow"
brew "tlrc"
brew "tmux"
brew "topgrade"
brew "uv"
brew "yarn"
brew "yazi"
brew "zinit"
brew "zoxide"
brew "oven-sh/bun/bun"
brew "yuccastream/tap/tuna"
cask "1password"
cask "1password-cli"
cask "amneziavpn"
cask "arc"
cask "betterdisplay"
cask "browserstacklocal"
cask "chatgpt"
cask "claude-code"
cask "codex"
cask "cursor"
cask "cursor-cli"
cask "droid"
cask "figma"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "helium-browser"
cask "karabiner-elements"
cask "lasso-app"
cask "logi-options+"
cask "obs"
cask "onyx"
cask "openvpn-connect"
cask "pearcleaner"
cask "rocket-chat"
cask "telegram"
cask "warp"
cask "zen"
